### Aggregating dataframes
#### 1. Summary statistics

In [118]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
   'col1': ['Item0', 'Item0', 'Item0', 'Item1', 'ItemA', 'ItemA', 'ItemC'],
   'col2': ['Gold', 'Bronze', 'Gold', 'Silver', 'Silver', 'Bronze', 'Gold',],
   'col3': [1, 2, 5, 4, 2, 6, 10],
   'col4': [0.1, 8, 35, 14, 8, 9, 0.321]
})

print("mean, the avarage of the values")
df['col3'].mean()

mean, the avarage of the values

4.285714285714286

In [14]:
print("median, the value separating the higher half from the lower half of a data sample")
df['col3'].median()

median, the value separating the higher half from the lower half of a data sample

4.0

In [57]:
print("mode, the most frequently occurring number found in a set of numbers")
df['col3'].mode()

mode, the most frequently occurring number found in a set of numbers

0    2
dtype: int64

In [16]:
print("min value in the column")
df['col3'].min()

min value in the column

1

In [17]:
print("max value in the column")
df['col3'].max()

max value in the column

10

##### Variance and standard deviation are two types of an absolute measure of variability that describes how the observations are spread out around the mean.
- **Variance** is nothing but the average of the squares of the deviations
- Unlike, **standard deviation** is the square root of the numerical value obtained while calculating variance
- better explained with dogs: https://www.mathsisfun.com/data/standard-deviation.html

In [27]:
df['col3'].var()

9.571428571428571

In [28]:
df['col3'].std()

3.093772546815388

In [29]:
print("the sum of all the values")
df['col3'].sum()

the sum of all the values

30

In [38]:
print("returns the entire column with the cummulative sum of values")
df['col3'].cumsum()

returns the cummulative sum of values

0     1
1     3
2     8
3    12
4    14
5    20
6    30
Name: col3, dtype: int64

- In statistics, quantile referred to as a quantity that divides the dataset into two equal parts. Quartiles, percentiles, and deciles are also quantile that divides the data into four, hundred, and ten equal parts respectively.
- `.quantile()` returns Series or DataFrame that consists of values at a given quantile over the requested axis. While finding the quantile, this method arranges the data in ascending order and we can use the formula to find the position that is q*(n+1) where q is the quantile and n is the total number of elements.
- `df['col3'].quantile()` returns the value that divides all the values into two equal parts
- more on this: https://www.studytonight.com/pandas/pandas-dataframe-quantile-method

In [34]:
df['col3'].quantile()

4.0

- all these methods can be passed to `.agg()`, to calculate on all (suitable) columns

In [88]:
df.agg('mean')

col3     4.285714
col4    10.631571
dtype: float64

In [53]:
df.agg('sum')

col1     Item0Item0Item1Item1ItemAItemBItemC
col2    GoldBronzeGoldSilverSilverBronzeGold
col3                                      30
col4                                  86.421
dtype: object

In [70]:
df.agg('max')
# or 
df.agg(max)

col1     ItemC
col2    Silver
col3        10
col4        35
dtype: object

In [59]:
df.agg('mode')

    col1  col2  col3  col4
0  Item0  Gold   2.0   8.0
1  Item1   NaN   NaN   NaN

#### 2. Counting
- to avoid counting duplicates we can use `df.drop_duplicates(subset = 'column_name')`, specifying the column where we only want to count the unique values
- to consider multiple columns while looking for duplicates, pass a list: `df.drop_duplicates(subset = ['column_name_1', 'column_name_2'])`

In [39]:
df.drop_duplicates(subset = 'col1')

    col1    col2  col3
0  Item0    Gold     1
2  Item1    Gold     5
4  ItemA  Silver     2
5  ItemB  Bronze     6
6  ItemC    Gold    10

In [40]:
df.drop_duplicates(subset = ['col1', 'col2'])

    col1    col2  col3
0  Item0    Gold     1
1  Item0  Bronze     2
2  Item1    Gold     5
3  Item1  Silver     4
4  ItemA  Silver     2
5  ItemB  Bronze     6
6  ItemC    Gold    10

- simple counting by `df['column_name'].value_counts()`
- return proptions by `df['column_name'].value_counts(normalize = True)`

In [46]:
df['col2'].value_counts()

Gold      3
Silver    2
Bronze    2
Name: col2, dtype: int64

In [47]:
df['col2'].value_counts(normalize = True)

Gold      0.428571
Silver    0.285714
Bronze    0.285714
Name: col2, dtype: float64

#### 3. Grouped summary statistics
- to perform the above statistical methods on a column, grouped by another column `df.groupby('group_by')['to_sum'].sum()`
- to perform multiple statistic methods, use `.agg([sum, min, max, 'etc'])`
- to group by multiple columns, pass a list `df.groupby(['col1', 'col2'])['col3'].sum()`

In [65]:
df.groupby('col2')['col3'].sum()

col2
Bronze     8
Gold      16
Silver     6
Name: col3, dtype: int64

In [74]:
df.groupby('col2')['col3'].agg([min, max, sum, 'mean'])

        min  max  sum      mean
col2
Bronze    2    6    8  4.000000
Gold      1   10   16  5.333333
Silver    2    4    6  3.000000

In [66]:
df.groupby(['col1', 'col2'])['col3'].sum()

col1   col2
Item0  Bronze     2
       Gold       1
Item1  Gold       5
       Silver     4
ItemA  Silver     2
ItemB  Bronze     6
ItemC  Gold      10
Name: col3, dtype: int64

#### 4. Pivot tables
- `df.pivot_table(values = 'col4', index = 'col2')`
- **values** argument is the column that you want **to calculate**
- **index** is the column that you want **to group by** 
- by default, pivot_table takes the **mean** value for each group
- to use different statistics method, use the `aggfunc =` parameter

In [75]:
 df.pivot_table(values = 'col4', index = 'col2')

          col4
col2
Bronze   8.500
Gold    11.807
Silver  11.000

In [77]:
df.pivot_table(values = 'col4', index = 'col2', aggfunc = np.max)

        col4
col2
Bronze   9.0
Gold    35.0
Silver  14.0

In [82]:
df.pivot_table(values = 'col4', 
               index = 'col2', 
               aggfunc = [np.min, np.max]
              )

       amin  amax
       col4  col4
col2
Bronze  8.0   9.0
Gold    0.1  35.0
Silver  8.0  14.0

- to separate results into columns, use the `columns =` parameter

In [97]:
df.pivot_table(values = 'col4', 
               index = 'col2', 
               aggfunc = np.max, 
               columns = 'col1'
              )

col1    Item0  Item1  ItemA  ItemB  ItemC
col2
Bronze    8.0    NaN    NaN    9.0    NaN
Gold     35.0    NaN    NaN    NaN  0.321
Silver    NaN   14.0    8.0    NaN    NaN

- to format missing values, add the `fill_value = 0` parameter

In [98]:
df.pivot_table(values = 'col4', 
               index = 'col2', 
               aggfunc = np.max, 
               columns = 'col1',
               fill_value = 0
              )

col1    Item0  Item1  ItemA  ItemB  ItemC
col2
Bronze      8      0      0      9  0.000
Gold       35      0      0      0  0.321
Silver      0     14      8      0  0.000

- set the argument `margins = True` so the last row and last column of the pivot table contain the mean of all the values in the column or row

In [101]:
df.pivot_table(values = 'col4', 
               index = 'col2', 
               columns = 'col1',
               margins = True 
              )

col1        Item0  Item1  ItemA  ItemB  ItemC        All
col2
Bronze   8.000000    NaN    NaN    9.0    NaN   8.500000
Gold    17.550000    NaN    NaN    NaN  0.321  11.807000
Silver        NaN   14.0    8.0    NaN    NaN  11.000000
All     14.366667   14.0    8.0    9.0  0.321  10.631571

#### 5. Explicit indexes
- setting a column as the index by `.set_index('column_as_index')`
- to reset the index, use `.reset_index()`
- setting `drop = True` drops the column used as an index completely

In [121]:
df_indexed = df.set_index('col1')
df_indexed

         col2  col3    col4
col1
Item0    Gold     1   0.100
Item0  Bronze     2   8.000
Item0    Gold     5  35.000
Item1  Silver     4  14.000
ItemA  Silver     2   8.000
ItemA  Bronze     6   9.000
ItemC    Gold    10   0.321

In [122]:
df_reset = df_indexed.reset_index()
df_reset

    col1    col2  col3    col4
0  Item0    Gold     1   0.100
1  Item0  Bronze     2   8.000
2  Item0    Gold     5  35.000
3  Item1  Silver     4  14.000
4  ItemA  Silver     2   8.000
5  ItemA  Bronze     6   9.000
6  ItemC    Gold    10   0.321

In [123]:
df_dropped_index = df_indexed.reset_index(drop = True)
df_dropped_index

     col2  col3    col4
0    Gold     1   0.100
1  Bronze     2   8.000
2    Gold     5  35.000
3  Silver     4  14.000
4  Silver     2   8.000
5  Bronze     6   9.000
6    Gold    10   0.321

- Indexes make subsetting simpler
- subsetting method `.loc` filters on index values, therefore easier with an index set to a column

In [124]:
df_indexed.loc[['Item0', 'Item1']]

         col2  col3  col4
col1
Item0    Gold     1   0.1
Item0  Bronze     2   8.0
Item0    Gold     5  35.0
Item1  Silver     4  14.0

- multilevel indexes by `.set_index(['col1', 'col2'])`

In [125]:
df_multi_index = df.set_index(['col1', 'col2'])
df_multi_index

              col3    col4
col1  col2
Item0 Gold       1   0.100
      Bronze     2   8.000
      Gold       5  35.000
Item1 Silver     4  14.000
ItemA Silver     2   8.000
      Bronze     6   9.000
ItemC Gold      10   0.321

- to subset on the inner index, pass a list of tuples: `.loc[[('val_index_outer', 'val_index_inner'),('val_index_outer_2', 'val_index_inner_2')]]`

In [128]:
df_multi_index.loc[[('Item0', 'Gold'), ('ItemA', 'Silver')]]

              col3  col4
col1  col2
Item0 Gold       1   0.1
      Gold       5  35.0
ItemA Silver     2   8.0

- sorting by index values with `.sort_index()` - by default, it sorts all index levels from outer to inner, in ascending order
- change the default by passing lists of `level = ['col2', 'col1']` and True or False for `ascending = `

In [129]:
df_multi_index.sort_index()

              col3    col4
col1  col2
Item0 Bronze     2   8.000
      Gold       1   0.100
      Gold       5  35.000
Item1 Silver     4  14.000
ItemA Bronze     6   9.000
      Silver     2   8.000
ItemC Gold      10   0.321

In [130]:
df_multi_index.sort_index(level = ['col2', 'col1'], ascending = [False, True])

              col3    col4
col1  col2
Item1 Silver     4  14.000
ItemA Silver     2   8.000
Item0 Gold       1   0.100
      Gold       5  35.000
ItemC Gold      10   0.321
Item0 Bronze     2   8.000
ItemA Bronze     6   9.000